src/ut10_old/Catalogs/ГруппыДляПроцентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ГруппыДляПроцентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ut10_old/InformationRegisters/ГруппыПроцентовПоМагазинам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ГруппыПроцентовПоМагазинам</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДляПроцентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/Catalogs/ГруппыДляПроцентов/Ext/ObjectModule.bsl
//Глобальная переменная
Перем Группа;


Процедура ПередЗаписью(Отказ)
		Если ЭтотОбъект.ЭтоНовый() Тогда
		Группа=ЭтотОбъект.Наименование;	
		КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Группа<>""Тогда
		Группа=Справочники.ГруппыДляПроцентов.НайтиПоНаименованию(Группа); 
		Выбор = Справочники.Склады.Выбрать();
		Пока Выбор.Следующий() Цикл
			Попытка
			Склад=Выбор.Ссылка;  
			НаборЗаписей = РегистрыСведений.ГруппыПроцентовПоМагазинам.СоздатьНаборЗаписей();
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период=ТекущаяДата();
			НоваяЗапись.Группа = Группа;
			НоваяЗапись.Магазин = Склад;
			НаборЗаписей.Записать(Ложь);
		Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Группа="";
